Revit 2027 API
Sweep.PathSketch Property
The sketched path for the sweep.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Sketch PathSketch { get; }
Public ReadOnly Property PathSketch As Sketch
	Get
public:
property Sketch^ PathSketch {
	Sketch^ get ();
}
member PathSketch : Sketch with get
Property Value
Sketch
Remarks
If the sweep is based on selected 3d curves, this property is null.
See Also
Reference
Sweep Class
Autodesk.Revit.DB Namespace